<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="utf-8" />
    <link rel="stylesheet" type="text/css" href="css/style.css" />
    <link
      href="https://fonts.googleapis.com/css?family=Lato&display=swap"
      rel="stylesheet"
    />
    <title>Project Explanation</title>
  </head>
  <body>
    <div>
      <div id="title">
        <h1>Explicaci&oacute;n del proyecto</h1>
      </div>
      <div id="subtitle">
        <h2>1. Descripci&oacute;n</h2>
      </div>

      <p>
        En la p&aacute;gina se podr&aacute;n ver las votaciones que se
        realizar&aacute;n en las comunidades de la rep&uacute;blica mexicana.
        Las votaciones que se podr&aacute;n visualizar ser&aacute;n a nivel
        municipal, estatal y nacional. Los usuarios tendr&aacute;n que crear una
        cuenta, al momento de crear su cuenta se les solicitar&aacute;
        introducir el c&oacute;digo QR que se encuentra en su credencial, de
        esta manera se verificar&aacute; que el usuario es apto para realizar la
        votaci&oacute;n y adem&aacute;s se le dar&aacute; acceso para realizar
        su voto solo en el &aacute;rea que le corresponda dependiendo de los
        datos que proporcione. Al finalizar el periodo de cada votaci&oacute;n,
        se realizar&aacute;n diferentes gr&aacute;ficas y estad&iacute;sticas
        para visualizar mejor los resultados de cada votaci&oacute;n. Hasta el
        momento, las pantallas que tenemos en mente para desplegar en la
        p&aacute;gina son: para inicio de sesi&oacute;n, crear cuenta, realizar
        votaci&oacute;n y visualizar resultados (&uacute;nicamente hasta que
        finalice la votaci&oacute;n).
      </p>
      <div id="subtitle">
        <h2>2. Problem&aacute;tica a resolver</h2>
      </div>
      <p>
        El objetivo del sistema es crear una forma de realizar votaciones de
        manera sencilla y r&aacute;pida, segura y confiable desde cualquier
        lugar. Un problema actual es que se realizan muchas encuestas de
        votaciones que resultan ser falsas o no dan datos precisos.
        Adem&aacute;s la manera en que se realizan las encuestas oficiales es de
        manera f&iacute;sica, por lo que el proceso es tardado tanto para
        realizar los votos como para hacer un conteo de estos.
      </p>
      <div id="subtitle">
        <h2>3. Soluci&oacute;n propuesta</h2>
      </div>
      <p>
        Los usuarios podr&aacute;n acceder al sistema de votaciones creando una
        cuenta y nos aseguraremos que el usuario es apto para votar mediante la
        petici&oacute;n del c&oacute;digo QR que se encuentra en las
        credenciales para votar del INE, de esta manera nos aseguraremos de que
        la persona que quiere realizar el voto es apta para poder votar y
        adem&aacute;s podremos obtener informaci&oacute;n sobre la persona para
        realizar diferentes estad&iacute;sticas y gr&aacute;ficas para analizar
        la gran cantidad de votos que se realicen. Los usuarios podr&aacute;n
        realizar votaciones a nivel municipal, estatal y federal. Dependiendo de
        la informaci&oacute;n proporcionada, ellos podr&aacute;n acceder a las
        votaciones correspondientes.
      </p>
      <div id="subtitle">
        <h2>4. Diferenciadorcon respecto a otras soluciones</h2>
      </div>

      <p>
        Actualmente no existe un sistema oficial que cumpla con las funciones
        del sistema que buscamos crear. Nuestro sistema permitir&aacute; a los
        usuarios realizar su votaci&oacute;n de manera r&aacute;pida y
        adem&aacute;s ser&aacute; posible obtener caracter&iacute;sticas de
        qui&eacute;n realiz&oacute; el voto con las que se podr&aacute;n
        realizar diferentes estad&iacute;sticas.
      </p>
      <div id="subtitle">
        <h2>5. Descripci&oacute;n de soluciones similares</h2>
      </div>
      <p>
        Encuestas en google forms y f&iacute;sicas. Este tipo de encuestas no
        son confiables, debido a que las votaciones pueden ser manipuladas al no
        haber algo que verifique que los votos fueron realizadas por personas
        reales que poseen una identificaci&oacute;n (INE). Otra raz&oacute;n por
        la que no son confiables es que &eacute;stas encuestas se realizan solo
        en ciertos lugares y no se toma en cuenta un gran porcentaje de la
        poblaci&oacute;n.
      </p>
      <div id="subtitle">
        <h2>6. Historias de usuario</h2>
      </div>
      <div id="subsubtitle" class="textstyle1">
        <h3>6.1. Registrarse</h3>
      </div>
      <p class="textstyle1">
        Como usuario quiero poder registrarme con los datos de mi credencial del
        INE para asegurar que solo yo pueda registrarme con mi credencial del
        INE y nadie se pueda hacer pasar por mi o crear cuentas falsas.
      </p>
      <div id="subsubtitle" class="textstyle2">
        <h3>6.2. Iniciar sesi&oacute;n</h3>
      </div>
      <p class="textstyle2">
        Como usuario quiero poder ingresar al sistema con una
        autentificaci&oacute;n usando el c&oacute;digo QR de mi INE para
        asegurar que solo yo con mi credencial pueda ingresar al sistema.
      </p>
      <div id="subsubtitle" class="textstyle3">
        <h3>6.3. Ver candidatos</h3>
      </div>
      <p class="textstyle3">
        Como usuario quiero ver los candidatos disponibles a los cual me
        corresponde votar de acuerdo a mi localidad para poder conocer las
        opciones que voy a tener al d&iacute;a de la elecci&oacute;n.
      </p>
      <div id="subsubtitle" class="textstyle4">
        <h3>6.4. Votar candidatos</h3>
      </div>
      <p class="textstyle4">
        Como usuario quiero poder seleccionar al candidato y votarlo para el
        d&iacute; de la elecci&oacute;n para poder hacer mis elecciones
        remotamente y de forma segura.
      </p>
      <div id="subsubtitle" class="textstyle5">
        <h3>6.5. Ver resultados en vivo</h3>
      </div>
      <p class="textstyle5">
        Como usuario quiero poder ver los resultados de la elecci&oacute;n en
        linea para tener resultados en directo y de forma instant&aacute;nea.
      </p>
      <div id="subsubtitle" class="textstyle6">
        <h3>6.6. Recuperaci&oacute;n de contrase&ntilde;a</h3>
      </div>
      <p class="textstyle6">
        Como usuario quiero poder ser capaz de recuperar mi contrase&ntilde;a en
        caso de olvidarla para poder seguir entrando al sistema en caso de
        olvidar mi contrase&ntilde;a.
      </p>
      <div id="subsubtitle" class="textstyle7">
        <h3>6.7. Reportar mal uso de mi cuenta</h3>
      </div>
      <p class="textstyle7">
        Como usuario quiero poder reportar si sospecho que alguien m&aacute;s
        entr&oacute; a mi cuenta o sospecho que alguien m&aacute;s est&aacute;
        entrando y haciendo mal uso de mi cuenta para hacer al sistema
        m&aacute;s seguro en caso de que alguien haya logrado acceder a mi
        cuenta.
      </p>
      <div id="subsubtitle" class="textstyle8">
        <h3>6.8. Crear propuestas</h3>
      </div>
      <p class="textstyle8">
        Como usuario quiero poder ser capaz de crear propuestas para mejorar las
        condiciones de mi localidad y que los otros usuarios puedan votar
        positivamente o negativamente de forma an&oacute;nima y que de
        est&aacute; forma le lleguen a los gobernantes nuestras distintas
        opiniones.
      </p>
      <div id="subsubtitle" class="textstyle9">
        <h3>6.9. Ver propuestas</h3>
      </div>
      <p class="textstyle9">
        Como usuario quiero poder ver las propuestas creadas por otros usuarios
        as&iacute; como la cantidad de votos que tienen y filtrarlas para poder
        saber lo que otros usuarios proponen.
      </p>
      <div id="subsubtitle" class="textstyle10">
        <h3>6.10. Votar propuestas</h3>
      </div>
      <p class="textstyle10">
        Como usuario quiero poder votar de forma positiva o negativa por las
        propuestas de otros usuarios para que pueda opinar de lo propuesto por
        otros usuarios.
      </p>
      <div id="subtitle">
        <h3>7. Cita de autor</h3>
      </div>
      <div id="cite">
        <a
          href="https://www.lja.mx/2020/02/jose-agustin-ortiz-pinchetti-quiere-blindar-los-procesos-electorales/"
        >
          <blockquote
            cite="https://www.lja.mx/2020/02/jose-agustin-ortiz-pinchetti-quiere-blindar-los-procesos-electorales/"
          >
            José Agust&oacute;n Ortiz Pinchetti, nombrado por el fiscal general,
            Alejandro Gertz Manero, como titular de la Fiscal&iacute;a
            Especializada en la Atenci&oacute;n de Delitos Electorales (Fepade),
            tiene confianza que este año se va a consolidar la Reforma
            Electoral, que blindar&aacute; los procesos electorales en el
            pa&iacute;s contra actividades il&iacute;citas, como las que
            presuntamente cometi&oacute; Emilio Lozoya con fines electorales.
          </blockquote>
          <div style="height: 40px;"></div>
          <cite>
            JOSÉ AGUSTÍN ORTIZ PINCHETTI QUIERE BLINDAR LOS PROCESOS ELECTORALES
          </cite>
          por LJA.mx
        </a>
      </div>
      <div id="subtitle">
        <h2>8. C&oacute;digo que podemos usar</h2>
      </div>
      <p>
        jQuery is a fast, small, and feature-rich JavaScript library. It makes
        things like HTML document traversal and manipulation, event handling,
        animation, and Ajax much simpler with an easy-to-use API that works
        across a multitude of browsers. With a combination of versatility and
        extensibility, jQuery has changed the way that millions of people write
        JavaScript.
      </p>
      <br />
      <p>
        <a href="https://jquery.com/">https://jquery.com/</a>
      </p>
      <br />
      <p>
        Example: $.ajax({ url: "/api/getWeather", data: { zipcode: 97201 },
        success: function( result ) { $( "#weather-temp" ).html( "<strong
          >" + result + "</strong
        >
        degrees" ); } });
      </p>
      <div style="height: 40px;"></div>
    </div>
  </body>
</html>
